Revit.Elements.Dimension.InternalSetElement(Autodesk.Revit.DB.Dimension)
Set the internal Element, ElementId, and UniqueId
element:

Revit.Elements.Dimension.AboveValue
The text shown above the segment's value, if the dimension has multiple segments a list of values will be returned.

Revit.Elements.Dimension.BelowValue
The text shown below the segment's value.

Revit.Elements.Dimension.SetAboveValue(System.String)
Sets the text shown above the segment's value.
value: The value to set
Returns: The dimension element

Revit.Elements.Dimension.SetBelowValue(System.String)
Sets the text shown below the segment's value.
value: The value to set
Returns: The dimension element